
//Исходно пустая конфигурация. Управляемое приложение.

//Создать справочник Контрагенты. Поля: Наименование. +

//Создать справочник Номенклатура. Поля: Наименование, единица измерения. +

//Создать справочник Единицы измерения. Поля: Наименование. Подчинен Номенклатуре

//Создать документ Реализация. Шапка: Контрагент. Табличная часть Товары:
 //Номенклатура, Кол-во, Цена, Сумма. В тч должны быть пересчеты суммы и цены. Должен быть подбор номенклатуры в тч.

//Создать документ Заказ. Шапка: Контрагент. Табличная часть Товары: Номенклатура, Кол-во, Цена, Сумма.

//Сделать форму списка Номенклатуры. Красным подсвечивать строки номенклатуры, по которой есть документы реализации.


//Сделать обработку формирования заказов контрагентов. Указывается месяц, обработка берет среднее количество реализаций 
//по каждому контрагенту и создает под каждого контрагента заказ с заполненной таблицей товаров (по среднему за указанный месяц).

//Реализовать систему скидок для контрагентов (%). Скидка назначается только контрагенту, распространяется на весь товар,
 //периодически может меняться размер скидки.
//В списке реализаций добавить колонку с процентом скидки на момент реализации. В самом документе скидку не хранить.

//Реализовать проверки и защиты на своё усмотрение.
//Всё, что описано, это основные требования. Вы можете задание расширять и дополнять как угодно для лучшего результата.

